Revit 2024 API
ElectricalEquipment.GetCircuitNamingSchemeType Method
 Gets enumerated type of the circuit naming scheme used with Electrical Equipment.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public CircuitNaming GetCircuitNamingSchemeType()
Visual Basic
Public Function GetCircuitNamingSchemeType As CircuitNaming
Visual C++
public:
CircuitNaming GetCircuitNamingSchemeType()
Return Value
 The enumerated type of circuit naming scheme.
See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace